# Read Write CSV File

In [1]:
import pandas as pd

In [9]:
df = pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [10]:
df = pd.read_csv("stock_data.csv", header = None) # if there is no header
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [12]:
# adding the comumn name
df = pd.read_csv("stock_data.csv", header = None, names = ["company","eps","rev","money","ceo"]) # 
df

   company            eps      rev  money            ceo
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [13]:
df

   company            eps      rev  money            ceo
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [14]:
df = pd.read_csv("stock_data.csv", nrows=3) # printing 3 rows 
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [16]:
df = pd.read_csv("stock_data.csv", na_values=["Not available","n.a."]) # putting NaN if it finds "Not available" or"n.a."
df

  tickers            eps  revenue   price         people
0   GOOGL          27.82       87   845.0     larry page
1     WMT           4.61      484    65.0            NaN
2    MSFT             -1       85    64.0     bill gates
3    RIL   not available       50  1023.0  mukesh ambani
4    TATA            5.6       -1     NaN     ratan tata

In [18]:
df = pd.read_csv("stock_data.csv", na_values= {
    'eps':["not available","n.a."],
    'revenue':["not available","n.a.",-1],
    'price':["not available","n.a."],
    'people':["not available","n.a."]
    }) 

df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

# Writing back to CSV

In [22]:
df.to_csv('new_stockData.csv',index=False)
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [30]:
df.to_csv('new_stockData.csv',columns=['tickers', 'eps'],index=False, header=False)

# # Read Write Excel  File

In [43]:
import pandas as pd

In [41]:
df = pd.read_excel("stock_data.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [45]:
# Converting the name, revenue

def convert_people(cell):
    if cell=="n.a.":
        return 'sam walton'
    return cell

def convert_revenue(cell):
    if cell==-1:
        return 10
    return cell

df = pd.read_excel("stock_data.xlsx","Sheet1",converters = {
    'people': convert_people,
    'revenue':convert_revenue
     })
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       10  n.a.     ratan tata

# Writing back to excel

In [51]:
df.to_excel("new_excel.xlsx",sheet_name="stocks",encoding='utf8',startrow=1, startcol=2)